// tests/testData.ts
export const mdContentWithInvalidSyntax = `Це текст у форматі Markdown. В межах нашої роботи ми розглядаємо дуже урізану підмножину цієї мови розмітки. Текст можна розділяти на абзаци, лишаючи між абзацами 1 (один) порожній рядок.

    **_invalid syntax_**
    _\`invalid code\`_

    Ми можемо виділяти текст **жирним**, робити його _курсивним_ або \`фіксованої ширини\`. Також є можливість зберігати фрагменти преформатованого тексту:

    \`\`\`
    Цей текст є преформатований.
       Це означає, що він відобразиться, як є, і жодне інше форматування, як от **жирний** чи _курсив_ на нього не
    впливає.          А ще тут усі пробіли, відступи та перенесення рядка зберігаються як є
    \`\`\`
    `; // your markdown string with invalid syntax
export const mdContentWithValidSyntax = `Це текст у форматі Markdown. В межах нашої роботи ми розглядаємо дуже урізану підмножину цієї мови розмітки. Текст можна розділяти на абзаци, лишаючи між абзацами 1 (один) порожній рядок.

    Ми можемо виділяти текст **жирним**, робити його _курсивним_ або \`фіксованої ширини\`. Також є можливість зберігати фрагменти преформатованого тексту:

    \`\`\`
    Цей текст є преформатований.
       Це означає, що він відобразиться, як є, і жодне інше форматування, як от **жирний** чи _курсив_ на нього не
    впливає.          А ще тут усі пробіли, відступи та перенесення рядка зберігаються як є
    \`\`\`
    `; // your markdown string with valid syntax
